def solution(letter):
    morse = { 
        '.-':'a','-...':'b','-.-.':'c','-..':'d','.':'e','..-.':'f',
        '--.':'g','....':'h','..':'i','.---':'j','-.-':'k','.-..':'l',
        '--':'m','-.':'n','---':'o','.--.':'p','--.-':'q','.-.':'r',
        '...':'s','-':'t','..-':'u','...-':'v','.--':'w','-..-':'x',
        '-.--':'y','--..':'z'
    }
    
    words = letter.split(' ')  # 공백을 기준으로 문자열을 나눕니다.
    result = ''

    for word in words:
        result += morse[word]  # 모스부호에 해당하는 영어 소문자를 결과에 추가합니다.

    return result